Revit 2027 API
PartUtils.IsPartDerivedFromLink Method
 Is the Part derived from link geometry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsPartDerivedFromLink(
	Part dPart
)
Public Shared Function IsPartDerivedFromLink (
	dPart As Part
) As Boolean
public:
static bool IsPartDerivedFromLink(
	Part^ dPart
)
static member IsPartDerivedFromLink :
        dPart : Part -> bool
Parameters
dPart Part
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PartUtils Class
Autodesk.Revit.DB Namespace